import pandas as pd
import numpy as np
data = {
    '이름': ['지훈', '민서', '서준', '예은', '도윤', '수아', '현우', '하은'],
    '성별': ['남', '여', '남', '여', '남', '여', '남', '여'],
    '학년': [1, 1, 2, 2, 3, 3, 4, 4],
    '전공': ['생명과학', '화학', '생명과학', '물리', '의생명', '화학', '의생명', '물리'],
    '중간고사': [87, 45, 67, 90, 77, 56, 80, 59],
    '기말고사': [88, 55, 70, 95, 60, 66, 85, 58],
    '과제점수': [90, 50, 75, 92, 65, 60, 82, 55]
}
df=pd.DataFrame(data)
# 학기말 반영비
# 중간고사 : 40%, 기말고사 : 40%, 과제 : 20%
df['총합']=(
    df['중간고사']*0.4 +
    df['기말고사']*0.4 + 
    df['과제점수']*0.2
)
df['학점']=pd.cut(
    df['총합'],
    bins = [0,49,60,80,100],
    labels = ['F','C','B','A']
)
df
#1 학점별 인원수 출력
print(df['학점'].value_counts())
#2 학점 A 받은 학생의 이름과 총합만 출력
print(df.loc[df['학점']=='A',['이름','총합']])
#3 학년별 평균 총합 구하기
print(df.groupby('학년')['총합'].mean())
#4 과제점수 기준 상위 3명 출력
print(df.sort_values(by='과제점수', ascending=False).head(3))
#5 '합격 여부' 컬럼 생성 (총합 >= 60 이면 PASS, 아니면 FAIL)
df['합격여부']=np.where(df['총합']>=60, 'pass','fail')
print(df[['이름','총합','합격여부']])
#6 전공별 평균 총합 구하기
print(df.groupby('전공')['총합'].mean())