import pandas as pd

data = {
    '이름': ['지훈', '민서', '서준', '예은', '도윤', '수아', '현우', '하은', '지민', '시우'],
    '성별': ['남', '여', '남', '여', '남', '여', '남', '여', '여', '남'],
    '반': ['A', 'A', 'B', 'B', 'C', 'C', 'A', 'B', 'C', 'A'],
    '전공': ['생명과학', '생명과학', '화학', '화학', '생명과학', '화학', '화학', '생명과학', '화학', '생명과학'],
    '중간고사': [95, 68, 91, 45, 100, 55, 70, 83, 35, 88],
    '기말고사': [40, 97, 60, 95, 35, 98, 65, 62, 95, 72],
    '과제': [55, 100, 80, 92, 85, 90, 60, 77, 100, 65],
}

df = pd.DataFrame(data)
df['총합'] = df['중간고사'] * 0.4 + df['기말고사'] * 0.4 + df['과제'] * 0.2
df=df.set_index('이름')
df

#반 별 총합의 평균
df.groupby('반')['총합'].mean()

#성별과 전공에 따른 총합 평균
df.groupby(['성별','전공'])['총합'].mean()

#전공별 1등 추출
df.loc[df.groupby('전공')['총합'].idxmax()]

#aggregation
df.groupby('성별').agg({
    '중간고사' : ['mean', 'max','min'],
    '기말고사' : ['mean', 'max','min'],
    '총합' : ['mean', 'std']
})